backend/app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes"
---
    def index
        notes = Note.all
        content = notes.map { |note| note.content }

INSERT INTO "notes" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "fadsfdfdsf"], ["created_at", "2021-06-26 02:40:07.704413"], ["updated_at", "2021-06-26 02:40:07.704413"]]
---
    def create
        notes = params[:notes]
        notes.map { |note| Note.create(content: note) }